mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
LTDC_HandleTypeDef hLtdc;
//{{{
void LCD_LTDC_IRQHandler() {

  if (LTDC->ISR & LTDC_IT_FU) ltdc.fifoUnderunIrq++;
  if (LTDC->ISR & LTDC_IT_TE) ltdc.transferErrorIrq++;

  // line interrupt
  if (LTDC->ISR & LTDC_IT_LI) {
    // switch showFrameBuffer
    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;

    ltdc.lineTicks = osKernelSysTick() - ltdc.lastTicks;
    ltdc.lastTicks = osKernelSysTick();
    ltdc.lineIrq++;

    if (ltdc.frameWait)
      osSemaphoreRelease (ltdc.sem);
    ltdc.frameWait = 0;
    }

  LTDC->ICR = LTDC_FLAG_LI | LTDC_FLAG_FU | LTDC_FLAG_TE;
  }
//}}}
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    uint32_t opcode = *mDma2dIsrBuf++;
    switch (opcode) {
      case kEnd:
        DMA2D->CR = 0;
        mDma2dIsrBuf = mDma2dBuf;
        osSemaphoreRelease (mDma2dSem);
        return;

      case kStamp:
        DMA2D->OMAR    = *mDma2dIsrBuf;   // output start address
        DMA2D->BGMAR   = *mDma2dIsrBuf++; // - repeated to bgnd start addres
        DMA2D->OOR     = *mDma2dIsrBuf;   // output stride
        DMA2D->BGOR    = *mDma2dIsrBuf++; // - repeated to bgnd stride
        DMA2D->NLR     = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR   = *mDma2dIsrBuf++; // fgnd start address
        DMA2D->FGPFCCR = DMA2D_INPUT_A8;  // fgnd PFC
        DMA2D->FGOR    = 0;               // fgnd stride
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        return;

      default: // opcode==address : value
        *(uint32_t*)opcode = *mDma2dIsrBuf++;
        if (opcode == AHB1PERIPH_BASE + 0xB000U) // CR
          return;
      }
    }
  }
//}}}

//{{{
//uint32_t readBmp (uint8_t *Address, const char* BmpName) {

  //uint8_t sector[512];
  //uint32_t index = 0, size = 0, i1 = 0;
  //uint32_t BmpAddress;
  //FIL F1;

  //if (f_open(&F1, (TCHAR const*)BmpName, FA_READ) != FR_OK)
  //if (f_read (&F1, sector, 30, (UINT *)&BytesRead) != FR_OK)

  //BmpAddress = (uint32_t)sector;

  ///* Read bitmap size */
  //size = *(uint16_t *) (BmpAddress + 2);
  //size |= (*(uint16_t *) (BmpAddress + 4)) << 16;

  ///* Get bitmap data address offset */
  //index = *(uint16_t *) (BmpAddress + 10);
  //index |= (*(uint16_t *) (BmpAddress + 12)) << 16;

  //f_close (&F1);

  //f_open (&F1, (TCHAR const*)BmpName, FA_READ);
  //do {
    //if (size < 256*2)
      //i1 = size;
    //else
      //i1 = 256*2;
    //size -= i1;
    //f_read (&F1, sector, i1, (UINT *)&BytesRead);

    //for (index = 0; index < i1; index++) {
      //*(__IO uint8_t*) (Address) = *(__IO uint8_t *)BmpAddress;
      //BmpAddress++;
      //Address++;
      //}
    //BmpAddress = (uint32_t)sector;
    //}

  //while (size > 0);
    //f_close (&F1);

  //return 1;
  //}
//}}}
//{{{
static void resize (const uint32_t* input, uint32_t* output,
                    uint32_t sourceWidth, uint32_t sourceHeight, uint32_t targetWidth, uint32_t targetHeight) {

  uint32_t wStepFixed16b = ((sourceWidth - 1) << 16)  / (uint32_t (targetWidth - 1));
  uint32_t hStepFixed16b = ((sourceHeight - 1) << 16) / (uint32_t (targetHeight - 1));

  uint32_t heightCoefficient = 0;
  for (uint32_t y = 0; y < targetHeight; y++) {
    uint32_t offsetY = (heightCoefficient >> 16);
    uint32_t hc2 = (heightCoefficient >> 9) & (unsigned char)127;
    uint32_t hc1 = 128 - hc2;

    uint32_t widthCoefficient = 0;
    uint32_t offsetPixelY  = offsetY * sourceWidth;
    uint32_t offsetPixelY1 = (offsetY + 1) * sourceWidth;

    for (uint32_t x = 0; x < targetWidth; x++) {
      uint32_t offsetX = (widthCoefficient >> 16);
      uint32_t wc2 = (widthCoefficient >> 9) & (unsigned char)127;
      uint32_t wc1 = 128 - wc2;

     uint32_t  offsetX1 = offsetX + 1;

      uint32_t pixel1 = *(input + (offsetPixelY  + offsetX));
      uint32_t pixel2 = *(input + (offsetPixelY1 + offsetX));
      uint32_t pixel3 = *(input + (offsetPixelY  + offsetX1));
      uint32_t pixel4 = *(input + (offsetPixelY1 + offsetX1));

      uint32_t a = ((((pixel1 >> 24) & 0xff) * hc1 + ((pixel2 >> 24) & 0xff) * hc2) * wc1 +
                    (((pixel3  >> 24) & 0xff) * hc1 + ((pixel4 >> 24) & 0xff) * hc2) * wc2) >> 14;

      uint32_t r = ((((pixel1 >> 16) & 0xff) * hc1 + ((pixel2 >> 16) & 0xff) * hc2) * wc1 +
                    (((pixel3  >> 16) & 0xff) * hc1 + ((pixel4 >> 16) & 0xff) * hc2) * wc2) >> 14;

      uint32_t g = ((((pixel1 >> 8) & 0xff) * hc1 + ((pixel2 >> 8) & 0xff) * hc2) * wc1 +
                    (((pixel3  >> 8) & 0xff) * hc1 + ((pixel4 >> 8) & 0xff) * hc2) * wc2) >> 14;

      uint32_t b = ((((pixel1) & 0xff) * hc1 + ((pixel2) & 0xff) * hc2) * wc1 +
                    (((pixel3)  & 0xff) * hc1 + ((pixel4) & 0xff) * hc2) * wc2) >> 14;

      *output++ = (a << 24) | (r << 16) | (g << 8) | b;

      widthCoefficient += wStepFixed16b;
      }

    heightCoefficient += hStepFixed16b;
    }
  }
//}}}

// cLcd
//{{{
cLcd::cLcd (uint32_t buffer0, uint32_t buffer1)  {

  mBuffer[false] = buffer0;
  mBuffer[true] = buffer1;

  updateNumDrawLines();
  }
//}}}
cLcd::~cLcd() {}

// static
cLcd* cLcd::mLcd = nullptr;
//{{{
cLcd* cLcd::create (std::string title, bool isr) {

  if (!mLcd) {
    mLcd = new cLcd (SDRAM_FRAME0, SDRAM_FRAME1);
    mLcd->mIsr = isr;
    mLcd->init (title);
    }

  return mLcd;
  }
//}}}
//{{{
std::string cLcd::hex (int value, uint8_t width) {

  std::ostringstream os;
  if (width)
    os << std::hex << std::setfill ('0') << std::setw (width) << value;
  else
    os << std::hex << value;
  return os.str();
  }
//}}}
//{{{
std::string cLcd::dec (int value, uint8_t width, char fill) {

  std::ostringstream os;
  if (width)
    os << std::setfill (fill) << std::setw (width) << value;
  else
    os << value;
  return os.str();
  }
//}}}

// public members
//{{{
void cLcd::setTitle (std::string title) {
  mTitle = title;
  updateNumDrawLines();
  }
//}}}
//{{{
void cLcd::setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

