mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  mShowTitle = title;
  mShowInfo = info;
  mShowLcdStats = lcdStats;
  mShowFooter = footer;

  updateNumDrawLines();
  }
//}}}

//{{{
void cLcd::info (uint32_t colour, std::string str, bool newLine) {

  bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

  auto line = (newLine && (mLastLine < mMaxLine-1)) ? mLastLine+1 : mLastLine;
  mLines[line].mTime = osKernelSysTick();
  mLines[line].mColour = colour;
  mLines[line].mString = str;
  if (newLine)
    mLastLine = line;

  if (tailing)
    mFirstLine = mLastLine - mNumDrawLines + 1;
  }
//}}}
//{{{
void cLcd::info (std::string str, bool newLine) {
  info (COL_WHITE, str, newLine);
  }
//}}}

//{{{
void cLcd::press (int pressCount, int x, int y, int z, int xinc, int yinc) {

  if ((pressCount > 30) && (x <= mStringPos) && (y <= getLineHeight()))
    reset();
  else if (pressCount == 0) {
    if (x <= mStringPos) {
      // set displayFirstLine
      if (y < 2 * getLineHeight())
        displayTop();
      else if (y > getHeight() - 2 * getLineHeight())
        displayTail();
      }
    }
  else {
    // inc firstLine
    float value = mFirstLine - ((2.0f * yinc) / getLineHeight());

    if (value < 0)
      mFirstLine = 0;
    else if (mLastLine <= (int)mNumDrawLines-1)
      mFirstLine = 0;
    else if (value > mLastLine - mNumDrawLines + 1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = value;
    }
  }
//}}}

//{{{
void cLcd::startRender() {

  mDrawBuffer = !mDrawBuffer;
  setLayer (0, mBuffer[mDrawBuffer]);

  // frameSync;
  ltdc.frameWait = 1;
  if (osSemaphoreWait (ltdc.sem, 100) != osOK)
    ltdc.timeouts++;

  mDrawStartTime = osKernelSysTick();
  }
//}}}
//{{{
void cLcd::renderCursor (uint32_t colour, int16_t x, int16_t y, int16_t z) {
  ellipse (colour, x, y, z, z);
  }
//}}}
//{{{
void cLcd::endRender (bool forceInfo) {

  auto y = 0;
  if ((mShowTitle || forceInfo) && !mTitle.empty()) {
    //{{{  draw title
    text (COL_YELLOW, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  if (mShowInfo || forceInfo) {
    //{{{  draw info lines
    if (mLastLine >= 0) {
      // draw scroll bar
      auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
      auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
      rectClipped (COL_YELLOW, 0, yorg, 8, height);
      }

    auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
    if (lastLine > mLastLine)
      lastLine = mLastLine;
    for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
      auto x = 0;
      auto xinc = text (COL_GREEN, getFontHeight(),
                        dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                        dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
      x += xinc + 3;
      text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
      y += getLineHeight();
      }
    }
    //}}}
  if (mShowLcdStats) {
    //{{{  draw lcdStats
    std::string str = dec (ltdc.lineIrq) + ":f " +
                      dec (ltdc.lineTicks) + "ms " +
                      dec (mDma2dTimeouts) + " " +
                      dec (ltdc.transferErrorIrq) + " " +
                      dec (ltdc.fifoUnderunIrq);
    text (COL_WHITE, getFontHeight(), str, 0, getHeight() - 2 * getLineHeight(), getWidth(), 24);
    }
    //}}}
  if (mShowFooter || forceInfo)
    //{{{  draw footer
    text (COL_YELLOW, getFontHeight(),
          dec (xPortGetFreeHeapSize()) + " " +
          dec (osGetCPUUsage()) + "% " +
          dec (mDrawTime) + "ms " +
          dec (mDma2dCurBuf - mDma2dBuf),
          0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
    //}}}

  // terminate opCode buffer
  *mDma2dCurBuf = kEnd;

   // send opCode buffer
  LCD_DMA2D_IRQHandler();

  // wait
  if (osSemaphoreWait (mDma2dSem, 500) != osOK)
    mDma2dTimeouts++;
  showLayer (0, mBuffer[mDrawBuffer], 255);

  // reset opcode buffer
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf = kEnd;

  mDrawTime = osKernelSysTick() - mDrawStartTime;
  }
//}}}
//{{{
void cLcd::flush() {

  clear (COL_BLACK);

  auto y = 0;
  if (!mTitle.empty()) {
    //{{{  draw title
    text (COL_YELLOW, getFontHeight(), mTitle, 0, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
    //}}}
  //{{{  draw info lines
  if (mLastLine >= 0) {
    // draw scroll bar
    auto yorg = getLineHeight() + ((int)mFirstLine * mNumDrawLines * getLineHeight() / (mLastLine + 1));
    auto height = mNumDrawLines * mNumDrawLines * getLineHeight() / (mLastLine + 1);
    rectClipped (COL_YELLOW, 0, yorg, 8, height);
    }

  auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
  if (lastLine > mLastLine)
    lastLine = mLastLine;
  for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
    auto x = 0;
    auto xinc = text (COL_GREEN, getFontHeight(),
                      dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                      dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'), x, y, getWidth(), getLineHeight());
    x += xinc + 3;
    text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString, x, y, getWidth(), getLineHeight());
    y += getLineHeight();
    }
  //}}}
  //{{{  draw footer
  text (COL_YELLOW, getFontHeight(),
        dec (xPortGetFreeHeapSize()) + " " +
        dec (osGetCPUUsage()) + "% " +
        dec (mDrawTime) + "ms " +
        dec (mDma2dCurBuf - mDma2dBuf),
        0, getHeight()-getLineHeight(), getWidth(), getLineHeight());
  //}}}
  *mDma2dCurBuf = kEnd;

  mDrawBuffer = false;
  mCurFrameBufferAddress = SDRAM_FRAME0;
  mSetFrameBufferAddress[0] = SDRAM_FRAME0;

  mDrawStartTime = osKernelSysTick();

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  uint32_t opcode = *mDma2dIsrBuf++;
  while (opcode != kEnd) {
    if (opcode == kStamp) {
      DMA2D->OMAR   = *mDma2dIsrBuf;   // bgnd dst start address
      DMA2D->BGMAR  = *mDma2dIsrBuf++; // - repeated to bgnd src start addres
      DMA2D->OOR    = *mDma2dIsrBuf;   // bgnd dst stride
      DMA2D->BGOR   = *mDma2dIsrBuf++; // - repeated to bgnd src stride
      DMA2D->NLR    = *mDma2dIsrBuf++; // width:height
      DMA2D->FGMAR  = *mDma2dIsrBuf++; // src start address
      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
      DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                    DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
      }
    else {
      *(uint32_t*)opcode = *mDma2dIsrBuf++;
      if (opcode == AHB1PERIPH_BASE + 0xB000U) {
        while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                      DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        }
      }
    opcode = *mDma2dIsrBuf++;
    }
  mDrawTime = osKernelSysTick() - mDrawStartTime;

  showFrameBufferAddress[0] = SDRAM_FRAME0;
  showAlpha[0] = 255;
  LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
  ltdcLayer->CFBAR = showFrameBufferAddress[0];
  ltdcLayer->CR |= LTDC_LxCR_LEN;
  ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
  ltdcLayer->CACR = 255;
  LTDC->SRCR |= LTDC_SRCR_IMR;

  mDma2dIsrBuf = mDma2dBuf;
  mDma2dCurBuf = mDma2dBuf;
  *mDma2dCurBuf = kEnd;
  }
//}}}

